app/controllers/movies_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    begin
      @movie = Movie.find(id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]

  def index
    #restore the ratings settings if all are unchecked
    if(params[:ratings] == {})
      params[:ratings] = session[:ratings]
    end

    #overwrite all session parameters that were passed in params
    params.each {|elt, value| session[elt] = value}

    @all_ratings = Movie.ratings

    #sorting by title or release
    if(session.has_key?(:sorting))
    	@movies = Movie.order("#{session[:sorting]}")
---
SELECT "movies".* FROM "movies" ORDER BY release_date DESC

  def create
    #debugger
    @movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 10 Oct 2013 01:19:24 UTC +00:00], ["description", nil], ["rating", nil], ["release_date", nil], ["title", nil], ["updated_at", Thu, 10 Oct 2013 01:19:24 UTC +00:00]]